Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You must previously have gotten the "handle" of the constant using the function shader_get_uniform(), and you will have to know what type of constant it is to pass the correct number of integer values through to it, ie: if you have a vec2 you will need to pass two values to the function.
zh_cn: 你必须事先使用shader_get_uniform()函数获得常量的"句柄"，你必须知道它是什么类型的常量，通过它传递正确的整数值的数量，例如:如果你有一个vec2，你需要传递两个值给函数。

source: You must previously have gotten the "handle" of the constant using the function shader_get_uniform().
zh_cn: 你必须在此之前使用shader_get_uniform()函数获得该常量的"句柄"。

source: You must previously have loaded the buffer into memory (using buffer_load()) and then passing that into this function will return a DS map populated with the contents of the buffer.
zh_cn: 您以前必须将缓冲区加载到内存中(使用buffer_load())，然后将其传递给此函数将返回一个填充了缓冲区内容的DS map。

source: You must then supply the buffer id which contains the data to be sent (for more information on buffers see Reference - Buffers) and finally the size (in bytes) of the data.
zh_cn: 然后必须提供包含要发送的数据的缓冲区id(有关缓冲区的更多信息，请参阅参考-缓冲区)，最后还要提供数据的大小(以字节为单位)。

source: You need to have previously created the both the button element (using clickable_add()) and the DS Map and supply the stored indices to each as arguments.
zh_cn: 您需要在之前创建按钮元素(使用clickable_add())和DS Map，并将存储的索引作为参数提供给它们。

source: You need to supply a starting grid cell (as an x and y axis coordinate) as well as the radius of the disk to set and the value that you wish to set the disk too, as shown by the illustration below:
zh_cn: 您需要提供一个起始网格单元(作为x和y轴坐标),以及要设置的圆盘半径和要设置的圆盘值，如下图所示:

source: You need to supply both the source and the destination arrays (both need to have been created previously), as well as a position within the source array to copy from and a position within the destination array to copy to.
zh_cn: 您需要提供源数组和目标数组(这两个数组都需要事先创建好)，以及源数组中要复制的位置和目标数组中要复制的位置。

source: You need to supply the group index which is the value returned when you created the group using the function audio_create_sync_group().
zh_cn: 您需要提供组索引，这是使用函数audio_create_sync_group()创建组时返回的值。

source: You need to supply the layer ID, which can either be the name of the layer as written in the code editor (as a string) or the actual layer ID value as returned by the layer_create(), and note that you can only deactivate instance layers with this function.
zh_cn: 您需要提供层ID，它可以是代码编辑器中写入的层名称(作为字符串)，也可以是layer_create()返回的实际层ID值，注意，您只能通过此函数禁用实例层。

source: You need to supply the layer ID, which can either be the name of the layer as written in the code editor (as a string) or the actual layer ID value as returned by the layer_create() and all deactivated instances on that layer will activated once again.
zh_cn: 你需要提供层ID，它可以是代码编辑器中写入的层名称(作为字符串)，也可以是layer_create()返回的实际层ID值，该层上所有未激活的实例将再次激活。

source: You need to supply the sprite index to set, the animation speed and the type of animation speed to apply.
zh_cn: 您需要提供要设置的精灵索引、动画速度和要应用的动画速度类型。

source: You pass data format (only buffer_u8 or buffer_s16 are currently supported), the sample rate (which can be between 1000hz and 48000hz), and the channels that the audio requires from one of the constants listed below:
zh_cn: 你传递数据格式(目前只支持buffer_u8或buffer_s16)，采样率(可以在1000hz到48000hz之间)，以及音频所需的通道，从下面列出的常量之一:

source: You pass in the struct reference to check, and each entry in the array will be a string of the variable names that the struct contains.
zh_cn: 传入结构引用进行检查，数组中的每个条目将是结构包含的变量名的字符串。

source: You provide a struct which contains a set of required parameters as well as any additional playback parameters.
zh_cn: 您提供了一个结构，其中包含一组必需的参数以及任何附加的回放参数。

source: You provide the coordinates for the upper left corner and lower right corner of the rectangular area to draw the text, and GameMaker will take care of the rest, with spacing and position being done automatically.
zh_cn: 你为绘制文本的矩形区域的左上角和右下角提供坐标，GameMaker将负责剩下的工作，并自动完成间距和位置。

source: You provide the emitter index to use, the sound index of the sound to be played and then specify whether the sound is to loop or not.
zh_cn: 您提供要使用的发射器索引，要播放的声音的声音索引，然后指定声音是否要循环。

source: You provide the format ID value (as returned by the function vector_format_end()), and this function will free the memory associated with it.
zh_cn: 您提供格式ID值(由函数vector_format_end()返回)，此函数将释放与之相关的内存。

source: You provide the sound index and assign it a priority, which is then used to determine how sounds are dealt with when the number of sounds playing is over the limit set by the function audio_channel_num().
zh_cn: 您提供声音索引并为其分配优先级，然后使用该优先级来确定当播放的声音数量超过函数audio_channel_num()设置的限制时如何处理声音。

source: You provide the sound index and then assign it a position within the 3D space.
zh_cn: 您可以提供声音索引，然后在3D空间中为其分配一个位置。

source: You set whether it is enabled (true) or disabled (false), the colour that the fog should use for blending, as well as the start and end draw distances.
zh_cn: 您可以设置它是启用(true)还是禁用(false)，雾应该用于混合的颜色，以及开始和结束绘制的距离。

source: You should also be aware that this function is dependent on the physics_world_update_speed() function.
zh_cn: 你也应该知道此函数依赖于physics_world_update_speed()函数。

source: You should also be sure to use the function timeline_delete() whenever you no longer wish to use the time line (like at the end of the room) so as to prevent any possible memory leaks that could slow down or crash your game.
zh_cn: 你还应该确保在你不再希望使用时间线的时候使用timeline_delete()函数(比如在房间的尽头)，以防止任何可能导致游戏变慢或崩溃的内存泄漏。

source: You should also note that HTTP request parameters (the bits sometimes "tacked on" to the end of a URL when you submit a form on a web page) are perfectly acceptable when using this function, for example:
zh_cn: 你还应该注意HTTP请求参数(当你在网页上提交表单时，有时会"附加"到URL的末尾)在使用此函数时是完全可以接受的，例如:

source: You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance.
zh_cn: 您还应该意识到，如果在实例的绘制事件中表面本身没有绘制到屏幕上，则什么也不会看到。

source: You should always check this using the is_undefined() function.
zh_cn: 您应该总是使用is_undefined()函数来检查这一点。

source: You should call the function push_get_first_local_notification() to get the first notification in the queue and then use this function to continue through it.
zh_cn: 您应该调用函数push_get_first_local_notification()来获取队列中的第一个通知，然后使用此函数继续处理它。

source: You should never destroy a camera that is currently assigned to a visible view, unless you are assigning a new camera to that view in the same step, and you should always destroy any cameras that you have created through code when no longer required by your game to prevent memory leaks, and you can also destroy the default cameras if you have any assigned in the Room Editor, but you should assign a new camera to the view port (or disable it) otherwise you will get odd results.
zh_cn: 永远不要销毁当前分配给可见视图的相机，除非您在同一步骤中为该视图分配新的相机，并且您应该始终销毁您通过代码创建的游戏不再需要的任何相机，以防止内存泄漏，如果您在房间编辑器中分配了任何默认相机，您也可以销毁默认相机，但是您应该为视图端口分配一个新的相机(或禁用它)，否则您会得到奇怪的结果。

source: You should note that a persistent room uses considerably more memory than a normal room and it is not recommended to have too many of them in your game.
zh_cn: 你应该注意到永久房间比普通房间占用更多的内存，不建议在你的游戏中有太多的永久房间。

source: You should note that if the texture page permits automatic cropping then this function may not work as expected, since the extra "empty" space around the sprite will have been removed for creating the texture page.
zh_cn: 您应该注意，如果纹理页面允许自动裁剪，则此函数可能无法按预期工作，因为精灵周围的额外"空白"空间将在创建纹理时页面被删除。

source: You should note too that this function must be called before defining any points, and you must also have at least three points defined for your polygon before binding it to an instance or you will get an error.
zh_cn: 你也应该注意到，此函数必须在定义任何点之前被调用，并且在将你的多边形绑定到一个实例之前，你也必须为你的多边形定义至少三个点，否则你将得到一个错误。

source: You should use this flag rather than set the density to 0.
zh_cn: 您应该使用此标志，而不是将密度设置为0。

source: You simply supply the function with a buffer id, and then an offset position (from the buffer start) within that buffer to read from, as well as the data type that you are wanting to read.
zh_cn: 您只需向此函数提供一个缓冲区id，然后提供要读取的缓冲区内的偏移位置(从缓冲区开始)，以及您想要读取的数据类型。

source: You simply supply the function with a buffer index, and then the offset position from the buffer start (in bytes) within that buffer to write to, as well as the data type and the value to be written.
zh_cn: 您只需为此函数提供一个缓冲区索引，然后提供要写入的缓冲区中从缓冲区开始的偏移位置(以字节为单位)，以及要写入的数据类型和值。

source: You specify an FX struct (as returned from fx_create() or layer_get_fx()) and a struct containing its parameters (as returned from fx_get_parameters()).
zh_cn: 指定一个FX结构(从fx_create()或layer_get_fx()返回)和一个包含其参数的结构(从fx_get_parameters()返回)。

source: You specify an FX struct (as returned from fx_create() or layer_get_fx()), a parameter name as a string, and its new value.
zh_cn: 指定FX结构(从fx_create()或layer_get_fx()返回)、字符串形式的参数名及其新值。

source: You specify the anchor point for the joint well as the two physics enabled instances to joint, and the first instance will act as the "body" for the joint, while the second will be the "wheel", and be permitted to move freely around the joint axis.
zh_cn: 您为关节井指定锚点，并为两个启用物理的实例指定关节，第一个实例将作为关节的"主体"，而第二个实例将作为"轮子"，并允许绕关节轴自由移动。

source: You specify the bounding box of the area within the function and then use any of a series of constants to define the final emitter shape within this bounding box as well as the distribution of particles within the shape.
zh_cn: 在函数中指定区域的边界框，然后使用一系列常量中的任何一个来定义该边界框内的最终发射器形状以及该形状内的粒子分布。

source: You specify the buffer ID of the buffer to use, then an offset value (in bytes) for where to begin, and then a size (again in bytes) for the region to be hashed, and the function will return a 32 bit integer value for that region.
zh_cn: 您指定要使用的缓冲区的缓冲区ID，然后指定开始位置的偏移值(以字节为单位),然后指定要散列的区域的大小(也是以字节为单位),此函数将返回该区域的32位整数值。

source: You specify the device slot to get, and the function will return a value between 0 to 1, where value reflects the threshold under which the joystick axis is considered to be at 0.
zh_cn: 你指定要获取的设备槽位，函数将返回一个介于0到1之间的值，该值反映了操纵杆轴处于0以下的阈值。

source: You specify the device slot to set, and then give a colour, which can be any of the colour constants or a colour value created using the specific colour functions or a HEX value(like $FFFFFFF).
zh_cn: 您指定要设置的设备插槽，然后给出一个颜色，它可以是任何颜色常量或使用特定颜色函数创建的颜色值或十六进制值(如$FFFFFFF)。

source: You specify the device slot to set, and then set a value from 0 to 1 and if the input amount is lower than the given value, the joystick axis is considered to be at 0.
zh_cn: 您指定要设置的设备插槽，然后设置一个从0到1的值，如果输入量低于给定值，操纵杆轴将被视为处于0。

source: You specify the object that you want to find the instance of and a number, and if there is an instance at that position in the instance list then the function returns the id of that instance, and if not it returns the special keyword noone.
zh_cn: 指定要查找实例的对象和一个数字，如果实例列表中该位置有实例，则函数返回该实例的id，如果没有，则返回特殊关键字noone。

source: You specify the queue index to add to, and the buffer ID to get the data from as well as the position (offset) within the buffer and the number of bytes to add.
zh_cn: 您可以指定要添加的队列索引、从中获取数据的缓冲区ID、缓冲区中的位置(偏移量)以及要添加的字节数。

source: You supply a font index (which can be an asset added through the Asset Browser or a font added at runtime) and the function returns a struct with the following variables:
zh_cn: 你提供一个字体索引(可以是通过资源浏览器添加的资源，也可以是在运行时添加的字体)，函数返回一个包含以下变量的结构:

source: You supply a method or function which is called when the exception occurs, and its first argument will be a struct containing information about the exception. This struct has the following format:
zh_cn: 您提供了一个在异常发生时被调用的方法或函数，它的第一个参数将是一个包含异常信息的结构。此结构具有以下格式:

source: You supply a minimum value and a maximum value for each of the three components and the particles created will have a random colour based on the given range of parameters.
zh_cn: 您为三个组件中的每一个提供一个最小值和一个最大值，创建的粒子将根据给定的参数范围具有随机的颜色。

source: You supply a sprite index (which can be an asset added through the Asset Browser or a sprite added at runtime) and the function returns a struct with the following variables:
zh_cn: 您提供一个精灵索引(可以是通过资源浏览器添加的资源，也可以是在运行时添加的精灵)，此函数返回一个包含以下变量的结构:

source: You supply a tileset index and the function returns a struct.
zh_cn: 您提供了一个图块集索引，该函数返回一个结构。

source: You supply an array of weak references to check (each weak reference should have been created using the function weak_ref_create()), and the function will return true if any of the structs are still being referenced somewhere or false if they are not and have been garbage collected.
zh_cn: 您提供一个弱引用数组来进行检查(每个弱引用都应该是使用weak_ref_create()函数创建的)，如果任何结构仍然在某个地方被引用，此函数将返回true;如果没有被引用并且已经被垃圾收集，则此函数将返回false。

source: You supply an array populated with the sprite indices (as defined when you created the sprite asset) and the texture pages that they are on will be loaded into memory.
zh_cn: 您提供一个填充了sprite索引(在创建sprite资源时定义)的数组，它们所在的纹理页面将被加载到内存中。

source: You supply either a single tag (as a string) or an array, where each item in the array is a tag (as a string), as well as the type of asset to check.
zh_cn: 您可以提供单个标记(作为字符串)或一个数组，其中数组中的每一项都是一个标记(作为字符串)，以及要检查的资源的类型。

source: You supply either a single tag string or an array, where each item in the array is a tag string.
zh_cn: 您可以提供单个标记字符串或一个数组，其中数组中的每一项都是一个标记字符串。

source: You supply either the asset name (as a string) or it's asset index, and the function will return an array of tags for that asset.
zh_cn: 您可以提供资源名称(以字符串形式)或资源索引，函数将返回该资源的标记数组。

source: You supply either the asset name (as a string) or its asset index, and if you supply an asset index value, then you will need to supply the optional asset type argument (a constant), as assets of different types can have the same index, even though they cannot have the same name.
zh_cn: 您可以提供资源名称(作为字符串)或其资源索引，如果您提供资源索引值，那么您将需要提供可选的资源类型参数(常量)，因为不同类型的资源可以具有相同的索引，即使它们不能具有相同的名称。

source: You supply either the asset name (as a string) or its asset index, as well as either a single tag string or an array where each item is a single tag string.
zh_cn: 您可以提供资源名称(作为字符串)或其资源索引，也可以提供单个标记字符串或每个项目都是单个标记字符串的数组。

source: You supply either the sequence object struct (as returned by the function sequence_create() or sequence_get()) or the sequence ID (as returned by the function layer_sequence_get_sequence() or from the sequence instance struct property sequence) and the function will return an array, where each item in the array is an object_index for the different objects being used by the sequence to create instances.
zh_cn: 您可以提供序列对象结构(由函数sequence_create()或sequence_get()返回)或序列ID(由函数layer_sequence_get_sequence()或序列实例结构属性sequence返回)，函数将返回一个数组，其中数组中的每一项都是序列用于创建实例的不同对象的object_index。

source: You supply either the sequence object struct (as returned by the function sequence_create() or sequence_get()) or the sequence ID (as returned by the function layer_sequence_get_sequence() or from the sequence instance struct property sequence, or the index from the asset browser) and the function will return true if the sequence object exists or false if it does not.
zh_cn: 你可以提供序列对象结构(由函数sequence_create()或sequence_get()返回)或序列ID(由函数layer_sequence_get_sequence()返回，或由序列实例结构属性sequence返回，或从资源浏览器返回索引)，如果序列对象存在，函数将返回true，如果不存在，函数将返回false。

source: You supply either the sequence object struct (as returned by the function sequence_create()) or the sequence ID (as returned by the function layer_sequence_get_sequence() or from the sequence instance struct property sequence).
zh_cn: 您可以提供序列对象结构(由函数sequence_create()返回)或序列ID(由函数layer_sequence_get_sequence()返回或由序列实例结构属性sequence返回)。

source: You supply either the unique ID value of the layer or the name of the layer (as a string - this will have a performance impact) , along with the ID of the shader to use.
zh_cn: 你可以提供层的唯一ID值或层的名称(作为字符串-这将有性能影响)，以及要使用的着色器的ID。

source: You supply the "index" value (as held in a variable) and the DS "type", which can be any of the constants listed below, and the function will return true if the data structure exists and false otherwise.
zh_cn: 你提供"index"值(保存在变量中)和DS"type"，它可以是下面列出的任何常量，如果数据结构存在，函数将返回true，否则返回false。

source: You supply the "slot" index for the gamepad to set, and then the map string, which should have been created using the SDL format with the following fields:
zh_cn: 你需要为手柄提供"slot"索引，然后是映射字符串，这应该是使用SDL格式创建的，包含以下字段:

source: You supply the Async event constant (shown in the table below) and a DS map which will be available in the called Async event in the async_load variable.
zh_cn: 您可以提供Async事件常量(如下表所示)和一个DS map，该映射将在async_load变量中的Async事件中可用。

source: You supply the DS map ID to get the keys from (as returned by ds_map_create()) and the function will return an array where each entry in the array is a key from the DS map.
zh_cn: 您提供DS map ID来获取其中的键(由ds_map_create()返回)，函数将返回一个数组，数组中的每个条目都是DS map中的一个键。

source: You supply the DS map ID to get the keys from (as returned by ds_map_create()) and the function will return an array where each entry in the array is a value from the DS map (for example, if the map has 10 keys, then an array of 10 entries will be returned with each entry corresponding to a value for a key).
zh_cn: 您提供DS mapID以从中获取键(由ds_map_create()返回)，函数将返回一个数组，其中数组中的每个条目都是来自DS map的值(例如，如果映射有10个键，那么将返回一个包含10个条目的数组，每个条目对应一个键的值)。

source: You supply the DS map ID value (as returned by the function ds_map_create()) and the ID of the buffer to write to (as returned by the function buffer_create()).
zh_cn: 提供DS mapID值(由函数ds_map_create()返回)和要写入的缓冲区的ID(由函数buffer_create()返回)。

source: You supply the DS map ID value (as returned by the function ds_map_create()), then give the key you want to set and the value to set it to.
zh_cn: 您提供DS mapID值(由函数ds_map_create()返回)，然后给出您想要设置的键和要设置它的值。

source: You supply the GIF file ID (as returned by the function gif_open()) and a surface ID (as returned by the function surface_create()), as well as a delay time between frames.
zh_cn: 您提供GIF文件ID(由函数gif_open()返回)和表面ID(由函数surface_create()返回)，以及帧之间的延迟时间。

source: You supply the GIF index (as returned by the function gif_open()) and the function will return a 1 byte-aligned grow buffer with the GIF data.
zh_cn: 您提供GIF索引(由函数gif_open()返回)，此函数将返回一个带有GIF数据的1字节对齐的增长缓冲区。

source: You supply the GIF index (as returned by the function gif_open()) as well as a filename to save it with.
zh_cn: 您需要提供GIF索引(由函数gif_open()返回)以及保存它的文件名。

source: You supply the ID of the buffer to compress (as returned by buffer_create()), the offset within the buffer to use in bytes, and the size of the buffer data to compress (also in bytes).
zh_cn: 您提供要压缩的缓冲区的ID(由buffer_create()返回)、缓冲区内要使用的偏移量(以字节为单位)以及要压缩的缓冲区数据的大小(也以字节为单位)。

source: You supply the alarm number from 0 to 11 and this function will return the value that the alarm is currently on.
zh_cn: 您提供从0到11的告警编号，此函数将返回当前告警的值。

source: You supply the alarm number from 0 to 11, and then the value to set the alarm to.
zh_cn: 您可以提供从0到11的告警编号，然后设置告警的值。

source: You supply the animation curve ID or struct as well as the channel name or index, and the function will return a struct with the following format:
zh_cn: 你提供动画曲线ID或结构以及通道名或索引，函数将返回一个具有以下格式的结构:

source: You supply the animation curve ID or struct, where the curve ID is the name of the animation curve as it was defined in the Asset Browser, or the struct pointer as returned by the function animcurve_create().
zh_cn: 您提供动画曲线ID或结构，其中曲线ID是在资源浏览器中定义的动画曲线的名称，或者是函数animcurve_create()返回的结构指针。

source: You supply the animation curve asset ID (as defined in the Asset Browser), and the function will return a struct with the following variables:
zh_cn: 您提供动画曲线资源ID(在资源浏览器中定义)，并且此函数将返回具有以下变量的结构:

source: You supply the array index value and the function will return an integer value representing the number of entries the array contains.
zh_cn: 您提供数组索引值，函数将返回一个整数值，表示数组包含的条目数量。

source: You supply the array to be resized as well as the new number of indices for the array, and the function will resize that array.
zh_cn: 您提供要调整大小的数组以及数组的新索引数，函数将调整该数组的大小。

source: You supply the asset index for the sequence as defined in the asset browser, and the function will return the sequence object struct that can then be accessed, or -1 if the sequence doesn't exist or the asset index given is not a sequence.
zh_cn: 您为资源浏览器中定义的序列提供资源索引，函数将返回随后可以访问的序列对象结构，如果序列不存在或给定的资源索引不是序列，则返回-1。

source: You supply the background ID (which you get when you create the background using layer_background_create() or when you use the layer ID along with layer_get_background_id()) and this will remove it.
zh_cn: 您提供背景ID(当您使用layer_background_create()创建背景时获得，或者当您将layer ID与layer_get_background_id()一起使用时获得)，这将删除它。

source: You supply the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then give a sprite index to be used.
zh_cn: 提供背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，然后给出要使用的sprite索引。

source: You supply the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the stretch argument to true or false.
zh_cn: 提供背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，然后将stretch参数设置为true或false。

source: You supply the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the visible argument to true or false.
zh_cn: 提供背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，然后将visible参数设置为true或false。

source: You supply the base sprite, the animation set to use and the frame to get the information from, and you can also set the transform properties to suit.
zh_cn: 你可以提供基本精灵、要使用的动画集和获取信息的框架，你还可以设置转换属性来适应。

source: You supply the buffer ID to decompress, and the function will return a new buffer ID that contains the uncompressed data.
zh_cn: 您提供要解压缩的缓冲区ID，此函数将返回一个包含未压缩数据的新缓冲区ID。

source: You supply the buffer index to use, the base primitive type to use (see the constants below) and the texture that is to be used.
zh_cn: 您提供要使用的缓冲区索引、要使用的基本图元类型(见下面的常量)和要使用的纹理。

source: You supply the buffer to write the data into as well as the UV position within the texture to use.
zh_cn: 您需要提供要写入数据的缓冲区，以及要使用的纹理中的UV位置。

source: You supply the buffer to write the data into as well as the red, green, blue and alpha values that you wish to use as a single 32-bit unsigned integer - alpha sample in the highest 8 bits, followed by the red sample, green sample and finally the blue sample in the lowest 8 bits.
zh_cn: 您提供缓冲区以将数据写入以及您希望用作单个 32 位无符号整数的红色、绿色、蓝色和 alpha 值 - 最先8位是透明度分量，然后是红色分量，绿色分量，最后8位蓝色分量。

source: You supply the buffer to write the data into as well as the x and y position for drawing.
zh_cn: 您需要提供写入数据的缓冲区以及绘图的x和y位置。

source: You supply the buffer to write the data into as well as the x, y and z component parts of the normal.
zh_cn: 您提供了写入数据的缓冲区以及法线的x、y和z组成部分。

source: You supply the buffer to write the data into as well as the x, y and z position for drawing.
zh_cn: 您需要提供用于写入数据的缓冲区，以及用于绘图的x、y和z位置。

source: You supply the depth that the new layer is to occupy and the function returns the unique Layer ID value that can then be used to access the layer in further functions.
zh_cn: 您提供新图层要占据的深度，函数返回唯一的图层ID值，该值可用于在后续函数中访问该图层。

source: You supply the file ID value, as returned by the function file_bin_open() and the byte of data to write.
zh_cn: 您提供文件ID值，由函数file_bin_open()返回，以及要写入的数据字节。

source: You supply the file ID value, as returned by the function file_bin_open(), and to append a file, move the position to the size of the file before writing.
zh_cn: 您提供文件ID值，由函数file_bin_open()返回，为了追加文件，在写入之前将位置移动到文件的大小。

source: You supply the file ID value, as returned by the function file_bin_open().
zh_cn: 提供文件ID值，由函数file_bin_open()返回。

source: You supply the gamepad "slot" to check, as well as the option string and the function will return the associated value.
zh_cn: 你提供要检查的手柄"slot"，以及选项字符串，函数将返回相关的值。
